<script lang="ts" setup>
    const eventTerms = [
        '本次抽奖活动仅限于年满18周岁及以上的个人参与。',
        '参与者承认并同意，参与本次抽奖活动可能存在风险，包括但不限于网络连接问题、信息泄露、技术故障等。参与者需自行承担因此产生的责任和风险。',
        '参与者访问本网页，根据浏览器cookie完成注册。每位参与者只可注册一次。',
        '获奖者将获得本店指定的奖品。奖品不可转让、兑换现金或其他物品。获奖者需自行承担领取某些奖品的相关费用。',
        '本次抽奖活动的起止时间不固定。将根据实际情况调整活动并及时通知参与者。',
        '本店对获奖者领取奖品过程中的延误、损失、错误不承担责任。获奖者需按照指定方式和时间领取奖品，若未及时领取而导致奖品失效，本店不承担责任。',
        '本店保留对本次抽奖活动规则进行修改、暂停、取消或终止的权利，且无需提前通知参与者。如有任何由于不可抗力、技术故障、欺诈行为等原因导致活动无法进行或结果受到影响，本店将不承担任何责任。',
    ]

</script>

<template>
    <Details titles="活动须知">
        <div text-xl>
            <ul list-none>
                <li v-for="(value, index) in eventTerms" m="t1 b2">
                    {{ value }}
                </li>
            </ul>
        </div>
        <Access />
    </Details>
</template>
<style scoped></style>